// Lab5.1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
// Напишіть програму, в якій оголошуються ціле Age і вказівник на ціле pAge. Задайте адресу цілого вказівнику. За допомогою вказівника встановіть значення цілої змінної 25. Виведіть значення змінної Age двома способами.

#include <iostream>

int main()
{
    int Age;
    int* pAge = &Age;
    *pAge = 25;
    std::cout << "Age = " << Age << std::endl;
    std::cout << "Age = " << *pAge << std::endl;
}

