// Lab1.3.9.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
// Дано значення температури T в градусах Фаренгейта. Визначити значення цієї ж температури в градусах Цельсія. Температура за Цельсієм TC і температура по Фаренгейту TF пов'язані наступним співвідношенням:      
// TC = 5 / 9 (TF − 32).


#include <iostream>

int main()
{
    double TF;
    std::cout << "Input T in F: ";
    std::cin >> TF;
    std::cout << "T in C: " << ((5./9.)*(TF - 32)) << std::endl;
}
